DROP TABLE "ЗАКАЗ";
DROP TABLE "ВОДИТЕЛЬ";
DROP TABLE "ЦЕНТР ОБСЛУЖИВАНИЯ";
DROP TABLE "ПРЕЙСКУРАНТ";
DROP TYPE my_month;

--CREATE
CREATE TABLE "ВОДИТЕЛЬ" (
	"ИДЕНТИФИКАТОР" 	SERIAL 			UNIQUE,
	"ФАМИЛИЯ" 			VARCHAR(50)		NOT NULL,
	"АВТОПРЕДПРИЯТИЕ"	VARCHAR(100)	NOT NULL,
	"ЛЬГОТА, %"			SMALLINT		NOT NULL,
	
	CHECK(("ЛЬГОТА, %" >= 0) AND ("ЛЬГОТА, %" <= 100)),
	PRIMARY KEY("ИДЕНТИФИКАТОР")
);

CREATE TABLE "ЦЕНТР ОБСЛУЖИВАНИЯ" (
	"ИДЕНТИФИКАТОР"		SERIAL			UNIQUE,
	"НАЗВАНИЕ"			VARCHAR(100)	NOT NULL,
	"ВЛАДЕЛЕЦ"			VARCHAR(100)	NOT NULL,
	"КОММИСИОННЫЕ, %"	SMALLINT		NOT NULL,
	
	CHECK(("КОММИСИОННЫЕ, %" >= 0) AND ("КОММИСИОННЫЕ, %" <= 100)),
	PRIMARY KEY("ИДЕНТИФИКАТОР")
);

CREATE TABLE "ПРЕЙСКУРАНТ" (
	"ИДЕНТИФИКАТОР"			SERIAL			UNIQUE,
	"ТОВАР"					TEXT			NOT NULL,
	"ЦЕНА, РУБ"				DECIMAL			NOT NULL,
	"У КОГО ЗАКУПАЕТСЯ"		VARCHAR(100)	NOT NULL,
	"МАКС. КОЛ-ВО"			BIGSERIAL		NOT NULL,
	
	PRIMARY KEY("ИДЕНТИФИКАТОР")
);

CREATE TYPE my_month AS ENUM ('Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 
							  'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь');
CREATE TABLE "ЗАКАЗ" (
	"НОМЕР ВЕДОМОСТИ"			SERIAL			UNIQUE,
	"ДАТА"						my_month,
	"ВОДИТЕЛЬ"					SERIAL			NOT NULL	REFERENCES "ВОДИТЕЛЬ"("ИДЕНТИФИКАТОР"),
	"ЦЕНТР ОБСЛ."				SERIAL			NOT NULL	REFERENCES "ЦЕНТР ОБСЛУЖИВАНИЯ"("ИДЕНТИФИКАТОР"),
	"ТОВАР ПО ПРЕЙСКУРАНТУ"		SERIAL			NOT NULL	REFERENCES "ПРЕЙСКУРАНТ"("ИДЕНТИФИКАТОР"),
	"КОЛ-ВО"					BIGSERIAL		NOT NULL,
	"ИТОГО, РУБ"				DECIMAL			NOT NULL,
	
	PRIMARY KEY("НОМЕР ВЕДОМОСТИ")
);

--INSERT
INSERT INTO "ВОДИТЕЛЬ" VALUES
	('001',	'Горбунов',	'АТП1',				'5'),
	('002',	'Попов',	'МП "ФорТУНА"',		'0'),
	('003',	'Денисов',	'АО "Автотранс"',	'10'),
	('004',	'Сергеев',	'АО "Автотранс"',	'10'),
	('005',	'Левкин',	'АТП1',				'5');

INSERT INTO "ЦЕНТР ОБСЛУЖИВАНИЯ" VALUES
	('001',	'Окружная дорога1',	'АТП1',				'3'),
	('002',	'Окружная дорога2',	'АТП1',				'3'),
	('003',	'123КМ',			'АО "Автотранс"',	'2'),
	('004',	'АЗС12',			'АО "ФорТУНА"',		'4'),
	('005',	'АЗС7',				'АТП1',				'3'),
	('006',	'У поворота',		'АО "ФорТУНА"',		'4');

INSERT INTO "ПРЕЙСКУРАНТ" VALUES
	('001',	'Бензин АИ-72',				'9000',		'АТП1',				'10000'),
	('002',	'Бензин АИ-96',				'10000',	'АТП1',				'12000'),
	('003',	'Масло моторное МТ23-12',	'7000',		'АО "ФорТУНА"',		'7000'),
	('004',	'Масло моторное УММ-23Т',	'18500',	'АО "Автотранс"',	'5300'),
	('005',	'Свеча зажигания', 			'22000',	'АО "Автотранс"',	'200'),
	('006',	'Прокладка',				'6000',		'АТП1',				'500'),
	('007',	'Жидкость смывная',			'12000',	'АО "ФорТУНА"',		'100');

INSERT INTO "ЗАКАЗ" VALUES
	('12201',	'Январь',	'002',	'004',	'007',	'4',	'48000'),
	('12202',	'Январь',	'003',	'005',	'007',	'4',	'48000'),
	('12203',	'Январь',	'003',	'005',	'007',	'6',	'72000'),
	('12204',	'Февраль',	'003',	'003',	'004',	'2',	'37000'),
	('12205',	'Февраль',	'004',	'002',	'001',	'40',	'360000'),
	('12206',	'Февраль',	'004',	'001',	'001',	'40',	'360000'),
	('12207',	'Март',		'003',	'001',	'001',	'20',	'180000'),
	('12208',	'Апрель',	'002',	'004',	'003',	'10',	'70000'),
	('12209',	'Апрель',	'003',	'003',	'006',	'4',	'24000'),
	('12210',	'Май',		'001',	'002',	'006',	'2',	'12000'),
	('12211',	'Май',		'003',	'006',	'003',	'2',	'14000'),
	('12212',	'Июнь',		'005',	'004',	'007',	'10',	'120000'),
	('12213',	'Июль',		'003',	'004',	'004',	'10',	'185000'),
	('12214',	'Июль',		'005',	'004',	'002',	'6',	'60000'),
	('12215',	'Август',	'002',	'006',	'005',	'4',	'88000'),
	('12216',	'Сентябрь',	'001',	'004',	'005',	'6',	'132000'),
	('12217',	'Сентябрь',	'003',	'001',	'007',	'40',	'360000');

--	3.	SELECT * FROM
--SELECT * FROM "ВОДИТЕЛЬ";

--SELECT * FROM "ЦЕНТР ОБСЛУЖИВАНИЯ";

--SELECT * FROM "ПРЕЙСКУРАНТ";

--SELECT * FROM "ЗАКАЗ";

--	4.	DISTINCT
--SELECT DISTINCT "ИДЕНТИФИКАТОР", "ФАМИЛИЯ" FROM "ВОДИТЕЛЬ";

--SELECT DISTINCT "АВТОПРЕДПРИЯТИЕ" FROM "ВОДИТЕЛЬ";

--SELECT DISTINCT "ВЛАДЕЛЕЦ" FROM "ЦЕНТР ОБСЛУЖИВАНИЯ";

--	5.	WHERE
/*SELECT "НАЗВАНИЕ", "ВЛАДЕЛЕЦ" FROM "ЦЕНТР ОБСЛУЖИВАНИЯ"
	WHERE ("КОММИСИОННЫЕ, %" < 4);*/

/*SELECT "НАЗВАНИЕ", "ВЛАДЕЛЕЦ", "КОММИСИОННЫЕ, %" FROM "ЦЕНТР ОБСЛУЖИВАНИЯ"
	WHERE ("НАЗВАНИЕ" LIKE '%АЗС%');*/

/*SELECT "ФАМИЛИЯ", "АВТОПРЕДПРИЯТИЕ" FROM "ВОДИТЕЛЬ"
	WHERE ("ЛЬГОТА, %" = 0);*/

--	6.
/*SELECT "ЗАКАЗ"."НОМЕР ВЕДОМОСТИ", "ЗАКАЗ"."ДАТА", "ВОДИТЕЛЬ"."ФАМИЛИЯ", "ЗАКАЗ"."ИТОГО, РУБ" FROM "ЗАКАЗ", "ВОДИТЕЛЬ"
	WHERE "ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР"
	ORDER BY "ВОДИТЕЛЬ"."ФАМИЛИЯ", "ЗАКАЗ"."ИТОГО, РУБ";*/

/*SELECT "ВОДИТЕЛЬ"."ФАМИЛИЯ", "ЦЕНТР ОБСЛУЖИВАНИЯ"."НАЗВАНИЕ", "ПРЕЙСКУРАНТ"."ТОВАР", "ЗАКАЗ"."КОЛ-ВО" 
FROM "ЗАКАЗ", "ВОДИТЕЛЬ", "ЦЕНТР ОБСЛУЖИВАНИЯ", "ПРЕЙСКУРАНТ"
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР");*/

--	7.
/*SELECT DISTINCT "ЦЕНТР ОБСЛУЖИВАНИЯ"."НАЗВАНИЕ" FROM "ЗАКАЗ", "ВОДИТЕЛЬ", "ЦЕНТР ОБСЛУЖИВАНИЯ", "ПРЕЙСКУРАНТ"
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР") AND
		("ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ" = "ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ") AND
		("ПРЕЙСКУРАНТ"."ЦЕНА, РУБ" BETWEEN '8000' AND '10000');*/

/*SELECT DISTINCT "ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ" FROM "ЗАКАЗ", "ВОДИТЕЛЬ", "ЦЕНТР ОБСЛУЖИВАНИЯ", "ПРЕЙСКУРАНТ"
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ДАТА" != 'ЯНВАРЬ') AND
		("ПРЕЙСКУРАНТ"."ТОВАР" LIKE '%Бензин%') AND
		("ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ" = 'АО "Автотранс"');*/

/*SELECT DISTINCT "ПРЕЙСКУРАНТ"."ТОВАР" FROM "ЗАКАЗ", "ВОДИТЕЛЬ", "ЦЕНТР ОБСЛУЖИВАНИЯ", "ПРЕЙСКУРАНТ"
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР") AND
		("ВОДИТЕЛЬ"."ФАМИЛИЯ" = 'Денисов') AND
		("ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ" != "ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ");*/

/*SELECT "ЗАКАЗ"."НОМЕР ВЕДОМОСТИ", "ЗАКАЗ"."ДАТА", 
	"ЦЕНТР ОБСЛУЖИВАНИЯ"."НАЗВАНИЕ", "ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ",
	"ПРЕЙСКУРАНТ"."У КОГО ЗАКУПАЕТСЯ"
FROM "ЗАКАЗ", "ВОДИТЕЛЬ", "ЦЕНТР ОБСЛУЖИВАНИЯ", "ПРЕЙСКУРАНТ"
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР") AND
		("ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ" != "ПРЕЙСКУРАНТ"."У КОГО ЗАКУПАЕТСЯ")
		ORDER BY "ЗАКАЗ"."ДАТА";*/
		
		--/*ORDER BY CASE WHEN "ЗАКАЗ"."ДАТА" = 'Январь' 	THEN 1
					--WHEN "ЗАКАЗ"."ДАТА" = 'Февраль' 	THEN 2
					--WHEN "ЗАКАЗ"."ДАТА" = 'Март' 		THEN 3
					--WHEN "ЗАКАЗ"."ДАТА" = 'Апрель' 		THEN 4
					--WHEN "ЗАКАЗ"."ДАТА" = 'Май' 		THEN 5
					--WHEN "ЗАКАЗ"."ДАТА" = 'Июнь' 		THEN 6
					--WHEN "ЗАКАЗ"."ДАТА" = 'Июль' 		THEN 7
					--WHEN "ЗАКАЗ"."ДАТА" = 'Август' 		THEN 8
					--WHEN "ЗАКАЗ"."ДАТА" = 'Сентябрь' 	THEN 9
					--WHEN "ЗАКАЗ"."ДАТА" = 'Октябрь' 	THEN 10
					--WHEN "ЗАКАЗ"."ДАТА" = 'Ноябрь' 		THEN 11
					--WHEN "ЗАКАЗ"."ДАТА" = 'Декабрь' 	THEN 12
				--END;*/

--	8.	UPDATE
UPDATE "ЗАКАЗ" SET "ИТОГО, РУБ" = (100 - "ВОДИТЕЛЬ"."ЛЬГОТА, %") * "ЗАКАЗ"."ИТОГО, РУБ" / 100 FROM "ВОДИТЕЛЬ"
	WHERE "ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР";
--SELECT * FROM "ЗАКАЗ";

--	9.	ADD
ALTER TABLE "ЗАКАЗ" ADD COLUMN "КОММИСИОННЫЕ, %" SMALLINT;
UPDATE "ЗАКАЗ" SET "КОММИСИОННЫЕ, %" = "ЦЕНТР ОБСЛУЖИВАНИЯ"."КОММИСИОННЫЕ, %" FROM "ЦЕНТР ОБСЛУЖИВАНИЯ"
	WHERE "ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР";
--SELECT * FROM "ЗАКАЗ";

--	10.	IN (NOT IN)
/*SELECT "ФАМИЛИЯ" FROM "ВОДИТЕЛЬ"
	WHERE "ИДЕНТИФИКАТОР" NOT IN
		(SELECT "ВОДИТЕЛЬ" FROM "ЗАКАЗ"
			WHERE "КОММИСИОННЫЕ, %" > 2);*/

/*SELECT "ФАМИЛИЯ" FROM "ВОДИТЕЛЬ"
	WHERE "ИДЕНТИФИКАТОР" IN
		(SELECT "ЗАКАЗ"."ВОДИТЕЛЬ" FROM "ЗАКАЗ", "ЦЕНТР ОБСЛУЖИВАНИЯ", "ПРЕЙСКУРАНТ"
			WHERE ("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND
				("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР") AND
		 		("ПРЕЙСКУРАНТ"."ТОВАР" = 'Масло моторное УММ-23Т') AND
				("ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ" != "ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ")
			GROUP BY "ЗАКАЗ"."ВОДИТЕЛЬ" HAVING COUNT("ЗАКАЗ"."ВОДИТЕЛЬ") > 1);*/

/*SELECT "НАЗВАНИЕ" FROM "ЦЕНТР ОБСЛУЖИВАНИЯ"
	WHERE "ИДЕНТИФИКАТОР" IN
		(SELECT "ЗАКАЗ"."ЦЕНТР ОБСЛ." FROM "ЗАКАЗ", "ВОДИТЕЛЬ", "ПРЕЙСКУРАНТ"
			WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
				("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР") AND
				("ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ" = "ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ") AND
				("ПРЕЙСКУРАНТ"."ЦЕНА, РУБ" BETWEEN '8000' AND '10000'));*/

/*SELECT "ТОВАР" FROM "ПРЕЙСКУРАНТ"
	WHERE "ИДЕНТИФИКАТОР" IN 
		(SELECT "ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" FROM "ЗАКАЗ", "ВОДИТЕЛЬ", "ЦЕНТР ОБСЛУЖИВАНИЯ"
			WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
				("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND
				("ВОДИТЕЛЬ"."ФАМИЛИЯ" = 'Денисов') AND
				("ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ" != "ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ"));*/

--	11.	ALL-ANY
/*SELECT "ФАМИЛИЯ" FROM "ВОДИТЕЛЬ"
	WHERE "ИДЕНТИФИКАТОР" = ANY
		(SELECT "ВОДИТЕЛЬ" FROM "ЗАКАЗ"
			WHERE "ТОВАР ПО ПРЕЙСКУРАНТУ" = ANY
				(SELECT "ТОВАР ПО ПРЕЙСКУРАНТУ" FROM "ЗАКАЗ"
					WHERE ("ДАТА" = 'Май') AND
						"КОЛ-ВО" = ALL (SELECT MAX("КОЛ-ВО") FROM "ЗАКАЗ"
										WHERE ("ДАТА" = 'Май'))));*/

/*SELECT movers."ФАМИЛИЯ" FROM "ВОДИТЕЛЬ" AS movers, "ЗАКАЗ"
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = movers."ИДЕНТИФИКАТОР")
	GROUP BY movers."ФАМИЛИЯ", movers."АВТОПРЕДПРИЯТИЕ" HAVING
		MAX("ЗАКАЗ"."ИТОГО, РУБ") = ALL (SELECT MAX("ЗАКАЗ"."ИТОГО, РУБ") FROM "ВОДИТЕЛЬ", "ЗАКАЗ"
											WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
												("ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ" = movers."АВТОПРЕДПРИЯТИЕ")
											GROUP BY "ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ");*/

/*SELECT "ВОДИТЕЛЬ"."ФАМИЛИЯ" FROM "ВОДИТЕЛЬ"
	WHERE "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР" = ANY
		(SELECT "ЗАКАЗ"."ВОДИТЕЛЬ" FROM "ЗАКАЗ"
			WHERE "ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = ANY
				(SELECT "ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" FROM "ЗАКАЗ", "ПРЕЙСКУРАНТ"
					WHERE ("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ".ИДЕНТИФИКАТОР) AND
						("ЗАКАЗ"."ДАТА" = 'Январь') AND
						("ПРЕЙСКУРАНТ"."ЦЕНА, РУБ" = ALL
							(SELECT MAX("ПРЕЙСКУРАНТ"."ЦЕНА, РУБ") FROM "ПРЕЙСКУРАНТ", "ЗАКАЗ"
								WHERE ("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ".ИДЕНТИФИКАТОР) AND
									("ЗАКАЗ"."ДАТА" = 'Январь'))))) AND
		("ВОДИТЕЛЬ"."ЛЬГОТА, %" = ALL
			(SELECT MIN("ВОДИТЕЛЬ"."ЛЬГОТА, %") FROM "ВОДИТЕЛЬ"
				WHERE "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР" = ANY
					(SELECT "ЗАКАЗ"."ВОДИТЕЛЬ" FROM "ЗАКАЗ"
						WHERE "ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = ANY
							(SELECT "ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" FROM "ЗАКАЗ", "ПРЕЙСКУРАНТ"
								WHERE ("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ".ИДЕНТИФИКАТОР) AND
									("ЗАКАЗ"."ДАТА" = 'Январь') AND
									("ПРЕЙСКУРАНТ"."ЦЕНА, РУБ" = ALL
										(SELECT MAX("ПРЕЙСКУРАНТ"."ЦЕНА, РУБ") FROM "ПРЕЙСКУРАНТ", "ЗАКАЗ"
											WHERE ("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ".ИДЕНТИФИКАТОР) AND
												("ЗАКАЗ"."ДАТА" = 'Январь')))))));*/

/*SELECT DISTINCT "ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ" FROM "ЦЕНТР ОБСЛУЖИВАНИЯ"
	WHERE "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР" = ANY
		(SELECT "ЗАКАЗ"."ЦЕНТР ОБСЛ." FROM "ЗАКАЗ"
			WHERE "ЗАКАЗ"."ДАТА" != 'Январь' AND
				("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = ANY
					(SELECT "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР" FROM "ПРЕЙСКУРАНТ"
						WHERE ("ПРЕЙСКУРАНТ"."ТОВАР" LIKE '%Бензин%'))) AND
				("ЗАКАЗ"."ВОДИТЕЛЬ" = ANY
					(SELECT "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР" FROM "ВОДИТЕЛЬ"
						WHERE ("ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ" = 'АО "Автотранс"'))));*/

--	12.	UNION
/*SELECT "АВТОПРЕДПРИЯТИЕ" FROM "ВОДИТЕЛЬ"
	UNION SELECT "У КОГО ЗАКУПАЕТСЯ" FROM "ПРЕЙСКУРАНТ"*/

--	13.	EXISTS (NOT EXISTS)
/*SELECT "ВОДИТЕЛЬ"."ФАМИЛИЯ" FROM "ВОДИТЕЛЬ", "ЗАКАЗ"
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" IN
		 	(SELECT DISTINCT "ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" FROM "ЗАКАЗ"
				WHERE ("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" NOT IN
		 			(SELECT DISTINCT "ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" FROM "ЗАКАЗ", "ЦЕНТР ОБСЛУЖИВАНИЯ"
						WHERE ("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND 
							(EXISTS (SELECT 1 FROM "ВОДИТЕЛЬ"
								WHERE ("ЦЕНТР ОБСЛУЖИВАНИЯ"."КОММИСИОННЫЕ, %" = (SELECT MAX("КОММИСИОННЫЕ, %") FROM "ЦЕНТР ОБСЛУЖИВАНИЯ"))))))))
	GROUP BY "ВОДИТЕЛЬ"."ФАМИЛИЯ" HAVING
		(COUNT(DISTINCT "ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ") = 
		 	(SELECT COUNT(DISTINCT "ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ") FROM "ЗАКАЗ"
				WHERE ("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" NOT IN
		 			(SELECT DISTINCT "ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" FROM "ЗАКАЗ", "ЦЕНТР ОБСЛУЖИВАНИЯ"
						WHERE ("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND 
							(EXISTS (SELECT 1 FROM "ВОДИТЕЛЬ"
								WHERE ("ЦЕНТР ОБСЛУЖИВАНИЯ"."КОММИСИОННЫЕ, %" = (SELECT MAX("КОММИСИОННЫЕ, %") FROM "ЦЕНТР ОБСЛУЖИВАНИЯ"))))))));*/

/*SELECT CUR_V."ФАМИЛИЯ" FROM "ВОДИТЕЛЬ" AS CUR_V, "ЦЕНТР ОБСЛУЖИВАНИЯ", "ЗАКАЗ" --AS CUR_O
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = CUR_V."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND
		(EXISTS (SELECT 1 FROM "ЗАКАЗ"
			   	WHERE (CUR_V."АВТОПРЕДПРИЯТИЕ" = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ")))
	GROUP BY CUR_V."ФАМИЛИЯ", "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР" HAVING
		(COUNT(DISTINCT "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") = (SELECT COUNT(DISTINCT "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") FROM "ВОДИТЕЛЬ", "ЦЕНТР ОБСЛУЖИВАНИЯ"
			WHERE ("ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ" = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ") AND
				("ВОДИТЕЛЬ"."ФАМИЛИЯ" = CUR_V."ФАМИЛИЯ")));*/

/*SELECT DISTINCT "ВОДИТЕЛЬ"."ФАМИЛИЯ" FROM "ЗАКАЗ", "ВОДИТЕЛЬ", "ПРЕЙСКУРАНТ"
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР") AND
		("ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ" = "ПРЕЙСКУРАНТ"."У КОГО ЗАКУПАЕТСЯ") AND
		(EXISTS (SELECT 1 FROM "ЦЕНТР ОБСЛУЖИВАНИЯ"
					WHERE ("ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР" NOT IN
						  	(SELECT DISTINCT "ЦЕНТР ОБСЛ." FROM "ЗАКАЗ"
								WHERE ("ДАТА" IN ('Ноябрь', 'Декабрь'))))));*/

/*SELECT "ВОДИТЕЛЬ"."ФАМИЛИЯ" FROM "ВОДИТЕЛЬ"
	WHERE EXISTS
		(SELECT 1 FROM "ЗАКАЗ"
			WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
				("ЗАКАЗ"."ИТОГО, РУБ" > 150000) AND
				("ЗАКАЗ"."ДАТА" = 'Сентябрь'));*/
	
--	14.	Агрегатные
/*SELECT DISTINCT "ВОДИТЕЛЬ"."ФАМИЛИЯ" FROM "ВОДИТЕЛЬ", "ЗАКАЗ", "ЦЕНТР ОБСЛУЖИВАНИЯ", "ПРЕЙСКУРАНТ"
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР") AND
		("ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ" != "ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ") AND
		("ПРЕЙСКУРАНТ"."ЦЕНА, РУБ" = (SELECT MAX("ЦЕНА, РУБ") FROM "ПРЕЙСКУРАНТ"));*/

/*SELECT COUNT("НОМЕР ВЕДОМОСТИ") FROM "ЗАКАЗ"
	WHERE "ВОДИТЕЛЬ" IN
		(SELECT "ИДЕНТИФИКАТОР" FROM "ВОДИТЕЛЬ"
			WHERE "ЛЬГОТА, %" = (SELECT MIN("ЛЬГОТА, %") FROM "ВОДИТЕЛЬ"));*/

/*SELECT "ПРЕЙСКУРАНТ"."ТОВАР" FROM "ЗАКАЗ", "ВОДИТЕЛЬ", "ЦЕНТР ОБСЛУЖИВАНИЯ", "ПРЕЙСКУРАНТ"
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР") AND
		("ВОДИТЕЛЬ"."АВТОПРЕДПРИЯТИЕ" = 'АТП1')
		GROUP BY "ПРЕЙСКУРАНТ"."ТОВАР" HAVING COUNT("ПРЕЙСКУРАНТ"."ТОВАР") > 3;*/

/*SELECT AVG("ЗАКАЗ"."ИТОГО, РУБ") FROM "ЗАКАЗ", "ПРЕЙСКУРАНТ"
	WHERE ("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР") AND
		(("ПРЕЙСКУРАНТ"."ТОВАР" = 'Свеча зажигания') OR ("ПРЕЙСКУРАНТ"."ЦЕНА, РУБ" < '8000'));*/

--	15.	GROUP BY
/*SELECT "ЦЕНТР ОБСЛУЖИВАНИЯ"."НАЗВАНИЕ", SUM("ЗАКАЗ"."ИТОГО, РУБ") FROM "ЗАКАЗ", "ЦЕНТР ОБСЛУЖИВАНИЯ"
	WHERE ("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР")
	GROUP BY "ЦЕНТР ОБСЛУЖИВАНИЯ"."НАЗВАНИЕ" HAVING SUM("ЗАКАЗ"."ИТОГО, РУБ") > '200000';*/

/*SELECT "ПРЕЙСКУРАНТ"."ТОВАР" FROM "ЗАКАЗ", "ВОДИТЕЛЬ", "ПРЕЙСКУРАНТ", "ЦЕНТР ОБСЛУЖИВАНИЯ"
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ТОВАР ПО ПРЕЙСКУРАНТУ" = "ПРЕЙСКУРАНТ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР") AND
		("ЦЕНТР ОБСЛУЖИВАНИЯ"."ВЛАДЕЛЕЦ" = 'АО "ФорТУНА"')
	GROUP BY "ПРЕЙСКУРАНТ"."ТОВАР" HAVING SUM("ЗАКАЗ"."ИТОГО, РУБ") <= 300000;*/

/*SELECT "ЗАКАЗ"."ДАТА", "ЦЕНТР ОБСЛУЖИВАНИЯ"."НАЗВАНИЕ", SUM("ЗАКАЗ"."ИТОГО, РУБ") FROM "ЗАКАЗ", "ЦЕНТР ОБСЛУЖИВАНИЯ"
	WHERE ("ЗАКАЗ"."ЦЕНТР ОБСЛ." = "ЦЕНТР ОБСЛУЖИВАНИЯ"."ИДЕНТИФИКАТОР")
	GROUP BY "ЗАКАЗ"."ДАТА", "ЦЕНТР ОБСЛУЖИВАНИЯ"."НАЗВАНИЕ"
	ORDER BY "ЗАКАЗ"."ДАТА", "ЦЕНТР ОБСЛУЖИВАНИЯ"."НАЗВАНИЕ";*/

/*SELECT "ВОДИТЕЛЬ"."ФАМИЛИЯ" FROM "ЗАКАЗ", "ВОДИТЕЛЬ"
	WHERE ("ЗАКАЗ"."ВОДИТЕЛЬ" = "ВОДИТЕЛЬ"."ИДЕНТИФИКАТОР") AND
		("ЗАКАЗ"."ДАТА" IN ('Март', 'Апрель', 'Май'))
	GROUP BY "ВОДИТЕЛЬ"."ФАМИЛИЯ" HAVING SUM("ЗАКАЗ"."ИТОГО, РУБ") > 1000000;*/

